tap "heroku/brew"
tap "rconroy293/seventeenlands"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Diff that understands syntax
brew "difftastic"
# Load/unload environment variables based on $PWD
brew "direnv"
# Isolated development environments using Docker
brew "docker-compose"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Asynchronous event library
brew "libevent"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU grep, egrep and fgrep
brew "grep"
# Tool for glamorous shell scripts
brew "gum"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Network authentication protocol
brew "krb5"
# Postgres C API library
brew "libpq"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# GNOME XML library
brew "libxml2"
# Linux virtual machines
brew "lima"
# Utility for directing compilation
brew "make"
# Java-based project management
brew "maven"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Libraries for security-enabled client and server applications
brew "nss"
# Modern shell for the GitHub era
brew "nushell"
# Shell command parallelization utility
brew "parallel"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Generic machine emulator and virtualizer
brew "qemu"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Command-line interface for 1Password
cask "1password-cli"
# Enable Windows-like alt-tab
cask "alt-tab"
# Securely stores and accesses AWS credentials in a development environment
cask "aws-vault-binary"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hbenl.vscode-test-explorer"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.test-adapter-converter"
vscode "nefrob.vscode-just-syntax"
vscode "pkief.material-icon-theme"
vscode "thebearingedge.vscode-sql-lit"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/ramya-rao-a/go-outline"
go "github.com/tebeka/go2xunit"
go "golang.org/x/tools/cmd/goimports"
go "github.com/fatih/gomodifytags"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/josharian/impl"
go "github.com/pdfcpu/pdfcpu/cmd/pdfcpu"
go "honnef.co/go/tools/cmd/staticcheck"
# Added to replace nvm as node version manager 
brew "mise"
cask "visual-studio-code"
